{
    "projects" : [
        {
            "title": "Graphium",
            "description": "A B2B SaaS Platform designed to resurface the crucial insights hidden across enterprises' unstructured data.",
            "link": "https://graphium.ai/",
            "tags": ["tech", "business"],
            "overview" : [
                "In 2020 I started a tech start-up with two co-founders. Over the course of 2 years we obtained £250K pre-seed investment; developed a working product; trialled the product with research teams across public and private sector, and onboarded paying customers.",
                "During this time we were also finalists for the 'Innovative' and 'Technology Services' catagories of the Welsh StartUp Awards, were titled a 'Welsh Rising Star' by TechNation."
            ],
            "imgs" : [
                {
                    "src": "https://d23gkw6990ie0c.cloudfront.net/graphium.png",
                    "alt": "Graphium Product Image Main"
                },
                {
                    "src": "https://d23gkw6990ie0c.cloudfront.net/graphium-1.jpeg",
                    "alt": "Graphium Product Image 2"
                },
                {
                    "src": "https://d23gkw6990ie0c.cloudfront.net/graphium-2.jpeg",
                    "alt": "Graphium Product Image 3"
                },
                {
                   "src": "https://d23gkw6990ie0c.cloudfront.net/graphium-3.jpeg",
                    "alt": "Graphium Product Image 4"
                },
                {
                    "src": "https://d23gkw6990ie0c.cloudfront.net/graphium-4.jpeg",
                    "alt": "Graphium Product Image 5"
                }
            ],
            "toolkit": [
                {
                    "skill": "Jira",
                    "icon": "/icons/skills/jira.png"
                },
                {
                    "skill": "Confluence",
                    "icon": "/icons/skills/confluence.png"
                },
                {
                    "skill": "Coda.io",
                    "icon": "/icons/skills/coda.png"
                },
                {
                    "skill": "PHP",
                    "icon": "/icons/skills/php.png"
                },
                {
                    "skill": "Laravel",
                    "icon": "/icons/skills/laravel.png"
                },
                {
                    "skill": "VueJS",
                    "icon": "/icons/skills/vue.png"
                },
                {
                    "skill": "Python",
                    "icon": "/icons/skills/python.png"
                },
                {
                    "skill": "FastAPI",
                    "icon": "/icons/skills/fastapi.svg"
                }
            ],
            "role" : 
                "As a Founder I worked in a variety of roles across the business. Some of my key responsibilities included planning the product roadmap; developing agile working infrastructures to manage the development team; communicating with key stakeholders such as investors, partners, and customers, and managing the day-to-day operations of the business.",
            "process": [
                "Working with a variety of different clients to understand the challenges they faced and their current workflows.",
                "Ideating a number of potential solutions to their challenges.",
                "Validating the potential market opportunity for these solutions through primary and secondary research.",
                "Utilising our research to identify the most promising business opportunity.",
                "Creating initial wireframes and user journeys to ensure the solution met the client needs.",
                "Creating initial feature prototypes to test with the users.",
                "Developing a concise business plan and strategy to turn the technology into a profitable business.",
                "Pitching to investors to ontain pre-seed investment.",
                "Developing product roadmaps and sprint plans to guide our growing development team.",
                "Supporting the development team using daily stand ups and fortnighty sprint restrospectives.",
                "Onboarding paying customers and managing our financial accounts."
            ],
            "result": [
                "Research teams deal with a vast amount of qualitative research data and, due to a lack of structure of this data, it's incredibly difficult to keep track of. Teams can waste precious time trying to rediscover the datapoints they need within the mass of information, often without success. This not only slows the research down, but can lead to the loss of key insights.",
                "To solve this problem, Graphium was created to automatically structure and visualise their data. Research teams can import their unstructured qualitative research data into the platform for it to be automatically structured and catagorised according to key topics.",
                "The platform offers various interactive and searchable visualisations so users can quickly discover relevant datapoints. The visualisations are also designed to help uncover new hidden insights across the data, such as gaps, trends, and interconnections - supporting users to make data driven decisions"
            ]
        },
        {
            "title": "Graph Visualisation",
            "description": "Utilising D3 and Neo4J to create dynamically generated knowledge graph visualisations.",
            "link": null,
            "tags": ["tech"],
            "overview" : [
                "One of the core features of the 'Graphium' platform is the ability to visualise the connections across the users' datasets. I implemented this feature within our software, using D3 and Neo4J."
            ],
            "imgs": [
                {
                    "src": "https://d23gkw6990ie0c.cloudfront.net/graphvis.png",
                    "alt": "Graphium Visualisation Example"
                },
                {
                    "src": "https://d23gkw6990ie0c.cloudfront.net/graphvis-2.png",
                    "alt": "Graphium Visualisation Example 2"
                },
                {
                    "src": "https://d23gkw6990ie0c.cloudfront.net/graphvis-3.png",
                    "alt": "Graphium Visualisation Example 3"
                },
                {   
                    "src": "https://d23gkw6990ie0c.cloudfront.net/graphvis-4.png",
                    "alt": "Graphium Visualisation Example 4"
                }
            ],
            "toolkit": [
                {
                    "skill": "VueJS",
                    "icon": "/icons/skills/vue.png"
                },
                {
                    "skill": "D3",
                    "icon": "/icons/skills/d3.png"
                },
                {
                    "skill": "Neo4J",
                    "icon": "/icons/skills/neo4j.png"
                }
            ],
            "role": 
                "I was responsible for implementing various graph visualisations within the product, but primarily the 'Knowledge Graph'. This visualisation depicts the connections between users, the data they have uploaded, and relavant topics to the data.",
            "process": [
                "Planning the data structure within the graph database, considering how the efficiency of reading and writing to the database can be maximised through the properties of, and relationships between, nodes.",
                "Using D3 to create a force-directed graph, populated with data from the graph database.",
                "Implementing functionality for users to interact with the graph. This included the ability to zoom, pan, and drag nodes. I also implemented the ability to filter the graph based on the properties of the nodes and relationships.",
                "Dynamically update the data visualised dependent on the user input and settings."
            ],
            "result": [
                "The result of the feature was a highly interactive and intuitive graph visualisation that allowed users to quickly explore the connections between their data. This feature was a key selling point of the platform, and was well received by users."
            ]
        },
        {
            "title": "Automatic Topic Extraction",
            "description": "Utilising Spacy.io to generate a custom Named Entity Recognition model.",
            "link": null,
            "tags": ["tech"],
            "overview" : [
                "In order to structure a set of qualitative data, the 'Graphium' platform needed the ability to extract key topics and map the relationships between them."
            ],
            "imgs": [
                {
                    "src": "https://d23gkw6990ie0c.cloudfront.net/topicextract-4.png",
                    "alt": "Graphium Topic Extraction Example Text"
                },
                {
                    "src": "https://d23gkw6990ie0c.cloudfront.net/topicextract-1.png",
                    "alt": "Graphium Topic Extraction Example Topics"
                },
                {
                    "src": "https://d23gkw6990ie0c.cloudfront.net/topicextract-2.png",
                    "alt": "Graphium Topic Extraction Example Keyphrases"
                },
                {   
                    "src": "https://d23gkw6990ie0c.cloudfront.net/topicextract-3.png",
                    "alt": "Graphium Topic Extraction Example Page"
                }
            ],
            "toolkit": [
                {
                    "skill": "Python",
                    "icon": "/icons/skills/python.png"
                },
                {
                    "skill": "Spacy",
                    "icon": "/icons/skills/spacy.png"
                },
                {
                    "skill": "Neo4J",
                    "icon": "/icons/skills/neo4j.png"
                }
            ],
            "role": 
                "I was responsible for experimenting with a variety of NLP tools and models, determining the most suitable implementation for the task, and implementing the final solution.",
            "process": [ 
                "Experimenting with a number of NLP tools for topic modelling and classification, such as tokenisation, Named Entity Recognition (NER), and Latent Semantic Analysis (LSA).",
                "After creating proof of concepts for each tool, I determined the most suitable solution for our platform - dependent on speed, efficiency, and accuracy.",
                "The chosen process was to use a mixture of ready-made Spacy models, alongside a custom-made NER model using Spacy training pipelines.",
                "A pre-defined topic ontology was utilised to determine which entities were suitable topics",
                "I developed a proprietary algorithm, utilising the pre-defined ontology, to determine relevancy scores between the extracted topics and the document.",
                "The final feature was implemented in Python, with the results stored in a Neo4J graph database."
            ],
            "result": [
                "The Graphium platform was able to extract key topics with relevancy scores, and some additional 'keyphrases' of interest. Later, I was able to extend the feature by enabling the user to personalise the topic structure to their use case and context by updating the pre-defined ontology." 
            ]
        },
        {
            "title": "Localite",
            "description": "An online community platform designed to help people connect, share, and learn from others in their local area.",
            "link": null,
            "tags": ["tech"],
            "overview" : [
                "A personal project exploring how to build communities within local areas, and enable users to meet connect with other people in their area who share similar interests."
            ],
            "imgs": [
                {
                    "src": "https://d23gkw6990ie0c.cloudfront.net/localite.png",
                    "alt": "Localite Product Image Main"
                },
                {
                    "src": "https://d23gkw6990ie0c.cloudfront.net/localite-1.png",
                    "alt": "Localite Product Image 2"
                },
                {
                    "src": "https://d23gkw6990ie0c.cloudfront.net/localite-2.png",
                    "alt": "Localite Product Image 3"
                }
            ],
            "toolkit": [
                {
                    "skill": "PHP",
                    "icon": "/icons/skills/php.png"
                },
                {
                    "skill": "Laravel",
                    "icon": "/icons/skills/laravel.png"
                },
                {
                    "skill": "AWS",
                    "icon": "/icons/skills/aws.png"
                }

            ],
            "role": 
                "I developed this product whilst at a start up incubator to practise designing, developing, and pitching a web platform",
            "process": [ 
                "Develop initial wireframes and design.",
                "Build the key features in Laravel.",
                "Deploy the platform to AWS.",
                "Present the platform to an audience of entrepeneurs and investors."
            ],
            "result": [
                "My platform was voted the best product of the cohort, against 15 other presentations. I did not take the product further, but it was a great learning experience for me to develop a product from start to finish, and present it to an audience."
            ]
        },
        {
            "title": "Utopi",
            "description": "Utopi develops sustainable, modular toys for children.",
            "link": null,
            "tags": [
                "design",
                "business"
            ],
            "overview": [
                "Plastic toys account for 90% of the toy market and are often discarded after a few months of use.",
                "Utopi aims to reduce this waste by creating modular toys, built with sustainable materials, that can be reconfigured to support the changing requirements of a childs development."
            ],
            "imgs": [
                {
                    "src": "https://d23gkw6990ie0c.cloudfront.net/utopi.png",
                    "alt": "Utopi Image Cover"
                },
                {
                    "src": "https://d23gkw6990ie0c.cloudfront.net/utopi-1.png",
                    "alt": "Utopi Website Example"
                },
                {
                    "src": "https://d23gkw6990ie0c.cloudfront.net/utopi-5.png",
                    "alt": "Utopi Prototype Example"
                }
            ],
            "toolkit": [
                {
                    "skill": "Maya",
                    "icon": "/icons/skills/maya.png"
                },
                {
                    "skill": "Canva",
                    "icon": "/icons/skills/canva.png"
                },
                {
                    "skill": "Wix",
                    "icon": "/icons/skills/wix.png"
                }
            ],
            "role": "Within our team of three, I was individually responsible for the development of our website and the 3D modelling of our product. Additionally, I worked alongside my team to undergo in-depth primary and secondary research to understand our target market, our competitors, and the wider social and environmental impacts of our product.",
            "process": [
                "Secondary PESTEL analysis of the chidren's toy market.",
                "Secondary research into sustainable materials and effective circular design practices.",
                "Primary research (surveys, probes, and prototype testing) with parents in our target market.",
                "Development of user personas based on our research.",
                "Ideation of product designs and business models.",
                "Development of a 3D model of our product (as well as some physical prototypes).",
                "Development of a website to showcase our product and business.",
                "Analysis of the feasibility and viability of the product and business.",
                "Final report and presentation of our product and business."
            ],
            "result": [
                "We designed 4 toys aimed at supporting different stages of children's development. These toys were housed within a modular box, which itself could be used for a variety of forms of play. The individual toys within the box could be returned once the child grew bored, and then re-used for another child - as such they were designed to be durable and easily to clean.",
                "Various incentives, such as discounts on new toys after a return, or opportunities for collective gift giving for childrens birthdays, were designed to encourage parents to switch to Utopi toys.",
                "We developed a physical prototype for some of the toys and gained real feedback from parents and children, as well as feedback from a number of children's toy sellers."
            ],
            "video": "https://www.youtube.com/embed/zG5cO2djp1M",
            "report": "utopi-report.pdf"
        },
        {
            "title": "The Grand Appeal",
            "description": "Developing an addition to The Grand Appeal's website to increase user engagement.",
            "link": null,
            "tags": ["tech"],
            "overview" : [
                "In 2018, The Grand Appeal (a Bristol based charity) worked with Aardman Studios to set up their third Arts Trail in Bristol, raising money for Bristol Children's Hospital.",
                "As a team of 6 Bristol Computer Science students, we were asked to design and develop a program for the Arts Trail website to encourage more people to pursue the trail."
            ],
            "imgs": [
                {
                    "src": "https://d23gkw6990ie0c.cloudfront.net/grandappeal.png",
                    "alt": "Grand Appeal Final Results"
                },
                {
                    "src": "https://d23gkw6990ie0c.cloudfront.net/grandappeal-1.png",
                    "alt": "Grand Appeal Social Media Screenshot"
                }
            ],
            "toolkit": [
                {
                    "skill": "Java",
                    "icon": "/icons/skills/java.png"
                }
            ],
            "role": 
                "My role focused on developing a concise product plan and report to be presented to the client, as well as developing various backend features of the tool.",
            "process": [ 
                "Collated a list of requirements from our client and other stakeholders.",
                "Brainstormed ideas based on these requirements and presented them to the client.",
                "Developed the tool, using agile methods to manage the planning and development.",
                "Presented a product demo for the client."
            ],
            "result": [
                "We utilised photos uploaded by visitors of the art trail to uncover a mystery 'Wallace and Gromit' themed collage. This created a motivation for users to engage with the trail and upload photos which could be shared for social media marketing.",
                "The idea developed from our insights that users were often families with young children who were looking a for a way to add gamification to the walk, entertain their children, and allow the whole family to interact and work together.",
                "The program used by The Grand Appeal during the arts trail on their website."
            ]
        },
        {
            "title": "Planana",
            "description": "A web app to help users plan their weekly meals and shopping lists.",
            "link": null,
            "tags": ["tech"],
            "overview": [
                "Creating meal plans can help people save money, reduce food waste, and eat healthily.",
                "This web app was designed to make it quick and easy to create a weekly meal plan, using an API integration with the 'Yummy' recipe API to discover new recipes."
            ],
            "imgs": [
                {
                    "src": "https://d23gkw6990ie0c.cloudfront.net/planana.png",
                    "alt": "Planana Product Image Main"
                }
            ],
            "toolkit": [
                {
                    "skill": "SQLite",
                    "icon": "/icons/skills/sqlite.png"
                },
                {
                    "skill": "Express",
                    "icon": "/icons/skills/express.png"
                },
                {   
                    "skill": "GIMP",
                    "icon": "/icons/skills/gimp.png"
                }
            ],
            "role": 
                "Within a team of three, I was responsible for designing the app layout and developing various frontend and backend features.",
            "process": [
                "Mapping user journeys throughout the app and creating basic wireframes.",
                "Developing the logo and png / svg images to use throughout the app",
                "Set up user authentication and database management using Express and SQLite.",
                "Implementing access to the Yummly API to allow users to search for recipes.",
                "Develop 'drag and drop' functionality in JavaScript for users to map recipes to days of the week.",
                "Enable users to export an ingredients list for their weekly plan to a pdf document."
            ],
            "result": [
                "The web app enabled users to sign in, explore various recipes, store chosen recipes within a weekly meal plan, save the plan, and export the ingredients list to a pdf document. A walkthrough of the website can be found below."
            ],
            "video": "https://www.youtube.com/embed/QVRkhRkGl80"
        },
        {
            "title": "UniBoost",
            "description": "UniBoost is an app designed to help students prioritise and care for their mental wellbeing.",
            "link": null,
            "tags": ["design", "business"],
            "overview" : [
                "There was a 210% increase in students dropping out of Universities for mental health related reasons between 2010 and 2015. UniBoost aims to tackle this problem by creating an accessible platform that encourages students to prioritise their mental wellbeing."
            ],
            "imgs": [
                {
                    "src": "https://d23gkw6990ie0c.cloudfront.net/uniboost.png",
                    "alt": "UniBoost Prototype Example"
                }
            ],
            "toolkit": [
                {
                    "skill": "Marvel",
                    "icon": "/icons/skills/marvel.png"
                },
                {
                    "skill": "Canva",
                    "icon": "/icons/skills/canva.png"
                },
                {
                    "skill": "Wix",
                    "icon": "/icons/skills/wix.png"
                }

            ],
            "role": 
                "Within a team of three, I was responsible for the development of the app prototype and the website. I also worked alongside my team to conduct primary and secondary research, develop user personas, and ideate the product and business model.",
            "process": [
                "Conduct primary research interviews with students, mental health professionals, and university organisations.",
                "Conduct secondary research into the mental health of students and the support available to them.",
                "Utilise collected research data to idenitify key problems and opportunities.",
                "Ideate potential software solutions and develop app prototypes using Marvel.",
                "Conduct prototype trials with university students to measure the impact of the solution.",
                "Develop a potential business strategy and map expected financial forecasts.",
                "Develop a website to showcase our product and business.",
                "Present a business plan and pitch to a board of university staff and business professionals."
            ],
            "result": [
                "The UniBoost app encouraged University Students to complete challenges aimed at improving their mental wellbeing, such as cooking a healthy meal, doing some exercise, having a mindfulness session, or meeting up with a friend. The incentive to complete these challenges were deals and discounts offered by local businesses.",
                "The app also connected students with their university by making key resources (student health organisations and support systems) easily accessible within the app.",
                "The prototype receieved positive feedback from trial users and from the board of university staff and business professionals."
            ],
            "report": "uniboost-report.pdf"
        },
        {
            "title": "3D Modelling",
            "description": "Working with Maya to develop realistic 3D models and animations.",
            "link": null,
            "tags": ["design"],
            "overview" : [
                "I have always been interested in 3D modelling and animation, and this project was an opportunity to practice modelling and animating using the software Maya."
            ],
            "imgs": [
                {
                    "src": "https://d23gkw6990ie0c.cloudfront.net/3dmodelling.png",
                    "alt": "3D Model Example"
                },
                {
                    "src": "https://d23gkw6990ie0c.cloudfront.net/3dmodelling-1.jpg",
                    "alt": "3D Model Example 2"
                },
                {
                    "src": "https://d23gkw6990ie0c.cloudfront.net/3dmodelling-2.png",
                    "alt": "3D Model Reference Image"
                }
            ],
            "toolkit": [
                {
                    "skill": "Maya",
                    "icon": "/icons/skills/maya.png"
                }
            ],
            "role": "This was a personal project based on my own interests.",
            "process": [ 
                "Created 3d replicas of individual items in the model/animation - using reference photos where possible.",
                "Arranged the models to create a realistic scene.",
                "Added textures and lighting to bring the models to life."
            ],
            "result": [
                "The end results of the project are depicted in the photos above, and the video below."
            ],
            "video" : "https://www.youtube.com/embed/4jOqVVh4M1s"
        }
    ]
}